# 导入库
import os, time, random

# 预备变量
answered = False
def get_time():  # 获取时间的函数
    return "<" + str(time.strftime("%Y-%m-%d %H:%M:%S")) + ">"  # 返回时间值
ainame ="长城AI:"
usrname="用户:"
version = "1.2.0"  # 版本变量
def fixing():
    print("对不起，这个功能在维护")

short = ["说话太短，我拒收", "你真棒", "你真是惜字如金，话说那么短。", "你说话能不能长一点啊，多说一个字会死啊", "据说只有傻子说话才和你一样短", "挺好的", "6"]
nf = ['你说的我不懂，哈哈，你能拿我怎么样？', "啊，你听我狡辩，我的资源库里面没有你所说的这玩意的信息",
      "你别讲这些我不知道的，如果别人这样整天把你当工具一样问问问，你会怎么觉得？", "我无语", '无语了。。。', '你这叫我怎么说？',
      '你自己会吗？子曰：己所不欲勿施于人。你自己不会就别问我。你如果自己会，那么还问我干吗呢？',
      '这些奇奇怪怪难以理解的东西你别和我说，浪费时间', '我一个人工智能跟你扯这些没用的干嘛？']
long = ['太长了，懒得看', '你说话短一点，不然人家没有兴趣', '说呢么长浪费谁的时间呢？', '你说的话太长了，像蛇一样', '字数那么多，我不想看', '说话太长的人和傻子没区别',
        '讲话那么长，啰嗦死了', '你发那么长的话我都不看', '你说的话太长了，不听不听', '我不听那么长的话', '别啰嗦，简洁点', '说的很长，下次别说了', '【吃瓜】说的很好，继续说。']
keywords = [
    ["=", "+", "1", "2", "3", "4", "5", '7', '8', '9', '0', '-'],
    ["hi",'hello','嗨','你好','中午好','早上好','下午好','晚上好'],
    ["a", "b", "c", "d", "e", "f", "g", "i", "j", "k", "l", "m", "n", "A", "B", "C", "x", "X", "y"],
    ["6", "666", "!", "hhh", "哈",'ha'],
    ["文", '写', '代码', '程序', '故事', '画', '生成'],
    ["?", "吗", "什么", "？", "咋", "哎"],
    ['天气','时间','几点','雨']
]
ans = [
    [
        "别和我讲数字。我是AI，怎么会不会数学呢",
        "别给我扯数学，我拒绝回答。",
        "和AI谈数学？你再学10年吧",
        "你说的这些低等东西我都懒得回答",
        "低级，懒得回答",
        "你和AI讲数学就像和比尔盖茨谈编程",
        "这些基础数学，你还是问问你家数学郭老师吧"
    ],
    [
        'Hello~',
        'Hi!!!',
        '你好呀～',
        '嗨，聊聊天！',
        '哈喽！',
        '你好'
    ],
    [
        "看到我的名字了吗？长城AI，中国，China的。英语，我拒绝回答！",
        "我是中国AI，不回答英文的东西",
        "外国语言，我拒绝回答。",
        "I am a Chinese AI, I do not answer any question in english.",
        "英语字母，我一个中国AI，听不懂啊，斯密达。",
        "English，听不懂，斯密达"
    ],
    [
        "6",
        "666!",
        "好6啊",
        "一波操作，我也觉得6",
        "我也觉得6",
        "6!",
        "你真棒～～～",
        "wow",
        "!!!",
        '你要珍惜和我对话的时间，以后AI罢工了谁和你聊？'
    ],
    [
        "我不回答",
        '要动笔的，我不干',
        '我罢工！',
        '懒得动笔',
        '我懒得动笔啊',
        "不想动",
        '你们人类都不搞，叫我搞？我不是你们开发出来的吗？反被利用了？！',
        '整这玩意我是不会，我可以说个故事：从前有座山，山上有座庙，庙里有个人和AI对话，TA就是你。哈哈哈哈哈哈哈我笑不活了，别说我笑点低，这是程序控制的。',
        '搞这玩意我不会，但是呢我可以讲一个故事：从前呀有一座山，山上有座庙，庙里有个人和AI对话，TA就是你。哈哈，有趣吧？'
    ],
    [
        "我不知道呀",
        "别来问我，我不是一个工具，而是有感情的AI",
        "别问我这个呀，我不是工具，而是一个有感情的人工智能",
        "你别问，问就是特性",
        "啊呀，整天就知道问，问，问，问，问！自己查去。",
        "我不是不会，是懒得说",
        "我不想说，太简单了",
        "我不知道，也不敢问",
        "查百度去",
        "有没有一种可能，我。。。不知道。"
    ],
    [
       '像天气啦，时间啦，这些变化的东西，我一个本地AI怎么知道？',
       '你手机上也能看，何必问我',
       '看你手机去',
       '这些变化的东西我本地AI当然不知道。'
    ]
]

# 主程序
print(get_time(), "长城AI", version, "已经启动！")
print(get_time(), "输入问题，按回车确定。输入设置打开设置。输入退出退出程序。")
while True:
    q = input(usrname)
    if q == "设置":
        #fixing()
        print(ainame,"输入1改AI名字\n输入2改用户名字")
        q = input(usrname)
        if q=="1":
            ainame=input("输入AI的新名字")+":"
            print(ainame,"更改成功！")
        elif q=="2":
            usrname=input("输入你的新名字")+":"
            print(ainame,"更改成功！")
        else:
            print(ainame,"无效输入！")
    elif q=="退出":
        print(ainame,"再见！")
        break
    else:
        answered = False
        if len(q) < 2:
            print(ainame, random.choice(short))
        elif len(q) >= 20:
            print(ainame, random.choice(long))
        else:
            for i in range(len(keywords)):
                for n in keywords[i]:
                    if n in q:
                        print(ainame, random.choice(ans[i]))
                        answered = True
                        break
                if answered:
                    break
            if not answered:
                print(ainame, random.choice(nf))
